#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jb-smoker/ace-automation-day-two/runs/run-A6FtYbWiXqiG5U9L

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aviatrix_distributed_firewalling_config.ace_automation will be created
  + resource "aviatrix_distributed_firewalling_config" "ace_automation" {
      + enable_distributed_firewalling = true
      + id                             = (known after apply)
    }

  # aviatrix_distributed_firewalling_policy_list.ace_automation will be created
  + resource "aviatrix_distributed_firewalling_policy_list" "ace_automation" {
      + id = (known after apply)

      + policies {
          + action                   = "PERMIT"
          + decrypt_policy           = "DECRYPT_UNSPECIFIED"
          + dst_smart_groups         = [
              + "def000ad-0000-0000-0000-000000000001",
            ]
          + exclude_sg_orchestration = false
          + flow_app_requirement     = "APP_UNSPECIFIED"
          + logging                  = true
          + name                     = "allow-internet-http"
          + priority                 = 0
          + protocol                 = "TCP"
          + src_smart_groups         = (known after apply)
          + uuid                     = (known after apply)
          + watch                    = false
          + web_groups               = (known after apply)

          + port_ranges {
              + lo = 80
            }
        }
      + policies {
          + action                   = "PERMIT"
          + decrypt_policy           = "DECRYPT_UNSPECIFIED"
          + dst_smart_groups         = [
              + "def000ad-0000-0000-0000-000000000001",
            ]
          + exclude_sg_orchestration = false
          + flow_app_requirement     = "APP_UNSPECIFIED"
          + logging                  = true
          + name                     = "allow-internet-https"
          + priority                 = 100
          + protocol                 = "TCP"
          + src_smart_groups         = (known after apply)
          + uuid                     = (known after apply)
          + watch                    = false
          + web_groups               = (known after apply)

          + port_ranges {
              + lo = 443
            }
        }
      + policies {
          + action                   = "PERMIT"
          + decrypt_policy           = "DECRYPT_UNSPECIFIED"
          + dst_smart_groups         = (known after apply)
          + exclude_sg_orchestration = false
          + flow_app_requirement     = "APP_UNSPECIFIED"
          + logging                  = true
          + name                     = "allow-rfc1918"
          + priority                 = 200
          + protocol                 = "ANY"
          + src_smart_groups         = (known after apply)
          + uuid                     = (known after apply)
          + watch                    = false
        }
      + policies {
          + action                   = "DENY"
          + decrypt_policy           = "DECRYPT_UNSPECIFIED"
          + dst_smart_groups         = [
              + "def000ad-0000-0000-0000-000000000000",
            ]
          + exclude_sg_orchestration = false
          + flow_app_requirement     = "APP_UNSPECIFIED"
          + logging                  = true
          + name                     = "default-deny-all"
          + priority                 = 2147483646
          + protocol                 = "Any"
          + src_smart_groups         = [
              + "def000ad-0000-0000-0000-000000000000",
            ]
          + uuid                     = (known after apply)
          + watch                    = false
        }
    }

  # aviatrix_smart_group.rfc1918 will be created
  + resource "aviatrix_smart_group" "rfc1918" {
      + id   = (known after apply)
      + name = "rfc1918"
      + uuid = (known after apply)

      + selector {
          + match_expressions {
              + cidr = "10.0.0.0/8"
            }
          + match_expressions {
              + cidr = "172.16.0.0/12"
            }
          + match_expressions {
              + cidr = "192.168.0.0/16"
            }
        }
    }

  # aviatrix_web_group.allow_internet_http will be created
  + resource "aviatrix_web_group" "allow_internet_http" {
      + id   = (known after apply)
      + name = "allowed-internet-http"
      + uuid = (known after apply)

      + selector {
          + match_expressions {
              + snifilter = "*.ubuntu.com"
            }
        }
    }

  # aviatrix_web_group.allow_internet_https will be created
  + resource "aviatrix_web_group" "allow_internet_https" {
      + id   = (known after apply)
      + name = "allowed-internet-https"
      + uuid = (known after apply)

      + selector {
          + match_expressions {
              + snifilter = "*.amazonaws.com"
            }
          + match_expressions {
              + snifilter = "*.aviatrix.com"
            }
          + match_expressions {
              + snifilter = "api.openai.com"
            }
          + match_expressions {
              + snifilter = "aviatrix.com"
            }
          + match_expressions {
              + snifilter = "aws.amazon.com"
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AVIATRIX_USERNAME" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-A6FtYbWiXqiG5U9L/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 5 estimated
           $0.0/mo +$0.0

</details>
Pusher: @jb-smoker, Action: `pull_request